org/notes/20231114094129-why_erlang_might_be_my_next_love.org
:PROPERTIES:
:ID:       31C25EEA-D823-4371-8B9D-5E4581FD719B
:END:
#+title: Why Erlang Might Be My Next Love

- tags ::[[id:23B81617-356A-43D5-BEB0-7884E86B5E48][ Erlang]]    

* NOTE Erlang is about programming for the right cases: you only program for what you know will happen and what you expect. Everything else should cause errors as soon as possible.

* NOTE The Erlang language is built for handling more complex interactions where the raw execution speed matter less

and the program structure matters more. If your system has no specific kernel which is executing for heavyweight processing, 
then Erlang might suit your needs. If your system is bound to memory or I/O then Erlang may be very suitable.


