content/garden/20231114094129-why_erlang_might_be_my_next_love.md
+++
title = "Why Erlang Might Be My Next Love"
author = ["Darrell Banks"]
draft = true
+++

-   tags ::[ Erlang]({{< relref "../../../../../../Dropbox/darrellbanks.com/org/notes/20231114093951-erlang.md" >}})


## NOTE Erlang is about programming for the right cases: you only program for what you know will happen and what you expect. Everything else should cause errors as soon as possible. {#note-erlang-is-about-programming-for-the-right-cases-you-only-program-for-what-you-know-will-happen-and-what-you-expect-dot-everything-else-should-cause-errors-as-soon-as-possible-dot}


## NOTE The Erlang language is built for handling more complex interactions where the raw execution speed matter less {#note-the-erlang-language-is-built-for-handling-more-complex-interactions-where-the-raw-execution-speed-matter-less}

and the program structure matters more. If your system has no specific kernel which is executing for heavyweight processing,
then Erlang might suit your needs. If your system is bound to memory or I/O then Erlang may be very suitable.
